INSERT INTO customers
	(name, surname, address, phone) 
VALUES
	('Виталий', 'Петров', 'ул. Пушкина, д. 22', '88005553535'),
	('Андрей', 'Штефанов', 'ул. Привокзальная, д. 12', '89811213123'),
	('Родион', 'Базаров', 'пр. Меньшевиков, д. 143', '89814744747'),
	('Светлана', 'Владимирова', 'ул. Крутая, д. 121', '88001239098'),
	('Мёске', 'Кобарёв', 'ул. Японская, д. 211', '88005758495'),
	('Аристарх', 'Попов', 'пр. Энергетиков, д. 32', '88005767384'),
	('Владимир', 'Моисеенко', 'ул. Горького, д. 123', '98710654321'),
	('Галина', 'Рыбкина', 'пр. Горбачёва, д. 333', '81249876543'),
	('Иван', 'Курчатов', 'ул. Некрасовского, д. 120', '87819200312'),
	('Сергей', 'Нечаев', 'ул. Горького, д. 56', '98710654321'),
	('Александр', 'Киселёв', 'пр. Горбачёва, д. 14', '81249876543'),
	('Анастасия', 'Грицева', 'ул. Строителей, д. 234', '81249876543'),
	('Владимир', 'Петров', 'ул. Полесская, д. 100', '98710654321'),
	('Марина', 'Медведева', 'ул. Гоголя, д. 333', '81249876543');

INSERT INTO materials 
	(name, description, price, stock) 
VALUES
	('Крокодил', 'Зелёная крокодилья кожа', 120, 24.6),
	('Кожа', 'Обычная коричневая кожа', 60, 36.1),
	('Картон', 'Печатный картон средней плотности', 23, 67),
	('Пластик', 'Эксперементальный прочный пластик', 100, 3.4),
	('Маленькая пчела', 'Полосатая золотистая кожа', 100, 35.8),
	('Солнечная тетрадь', 'Эксперементальный прочный пластик', 67, 2.7),
	('Жарко', 'Для пекинского огородного питания', 45, 18.2),
	('Рождественский дар', 'Эксперементальный прочный пластик', 90, 3.6),
	('Тигр', 'Прочнейший материал для работ на лесоповале', 25, 41.8);

INSERT INTO sizes (name) VALUES
	('Маленький'),
	('Средний'),
	('Большой'),
	('Крупный');

INSERT INTO book_orders 
	(customer_id, datetime, cost, number_of_turns, size_id, material_id)
VALUES
	(3, '2024-01-06 12:40:21', 3500, 12, 3, 1),
	(1, '2024-01-08 16:12:55', 1400, 4, 1, 2),
	(4,  '2024-01-09 13:00:43', 8000, 120, 3, 2),
	(6,  '2024-01-09 13:43:26', 6700, 18, 2, 4),
	(5,  '2024-01-12 11:30:59', 5000, 10, 4, 3),
	(7,  '2024-01-13 12:14:35', 6000, 8, 2, 4),
	(2,  '2024-02-14 13:57:29', 1800, 6, 1, 2),
	(8,  '2024-02-16 11:02:11', 9000, 20, 3, 9),
	(4,  '2024-02-17 15:58:04', 7000, 30, 4, 8),
	(1,  '2024-02-20 17:18:53', 6000, 12, 3, 5),
	(9, '2024-03-22 11:43:05', 12000, 24, 2, 2),
	(6, '2024-03-24 15:27:50', 9000, 28, 1, 6),
	(10, '2024-03-27 12:39:48', 15000, 36, 4, 7),
	(5, '2024-03-30 14:48:46', 8000, 20, 3, 7);

INSERT INTO painting_orders 
	(customer_id, datetime, cost, width, height)
VALUES
	(13, '2024-01-09 13:00:43', 1500, 240, 127),
	(2, '2024-01-10 13:12:31', 1800, 220, 140),
	(10, '2024-01-10 14:40:59', 1000, 160, 100),
	(9, '2024-02-03 15:17:48', 600, 100, 50),
	(11, '2024-02-06 15:34:52', 1200, 180, 90),
	(7, '2024-02-13 13:15:11', 1800, 240, 140),
	(4, '2024-02-20 16:47:24', 600, 80, 45),
	(2, '2024-03-04 14:38:21', 900, 100, 60),
	(12, '2024-03-10 17:09:57', 1500, 240, 165),
	(6, '2024-03-18 16:27:02', 1800, 300, 180),
	(9, '2024-03-25 12:59:05', 1200, 200, 120);
