import db
from model import *


def main():
    db.delete_db()
    db.create_tables()

    customers = [
        Customer("Виталий", "Петров", "ул. Пушкина, д. 22", "88005553535"),
        Customer("Андрей", "Штефанов", "ул. Привокзальная, д. 12", "89811213123"),
        Customer("Родион", "Базаров", "пр. Меньшевиков, д. 143", "89814744747"),
        Customer("Светлана", "Владимирова", "ул. Крутая, д. 121", "88001239098"),
        Customer("Мёске", "Кобарёв", "ул. Японская, д. 211", "88005758495"),
        Customer("Аристарх", "Попов", "пр. Энергетиков, д. 32", "88005767384"),
        Customer("Владимир", "Моисеенко", "ул. Горького, д. 123", "98710654321"),
        Customer("Галина", "Рыбкина", "пр. Горбачёва, д. 333", "81249876543"),
        Customer("Иван", "Курчатов", "ул. Некрасовского, д. 120", "87819200312"),
        Customer("Сергей", "Нечаев", "ул. Горького, д. 56", "98710654321"),
        Customer("Александр", "Киселёв", "пр. Горбачёва, д. 14", "81249876543"),
        Customer("Анастасия", "Грицева", "ул. Строителей, д. 234", "81249876543"),
        Customer("Владимир", "Петров", "ул. Полесская, д. 100", "98710654321"),
        Customer("Марина", "Медведева", "ул. Гоголя, д. 333", "81249876543"),
    ]

    materials = [
        Material("Крокодил", "Зелёная крокодилья кожа", 120, 24.6),
        Material("Кожа", "Обычная коричневая кожа", 60, 36.1),
        Material("Картон", "Печатный картон средней плотности", 23, 67),
        Material("Пластик", "Эксперементальный прочный пластик", 100, 3.4),
        Material("Маленькая пчела", "Полосатая золотистая кожа", 100, 35.8),
        Material("Солнечная тетрадь", "Эксперементальный прочный пластик", 67, 2.7),
        Material("Жарко", "Для пекинского огородного питания", 45, 18.2),
        Material("Рождественский дар", "Эксперементальный прочный пластик", 90, 3.6),
        Material("Тигр", "Прочнейший материал для работ на лесоповале", 25, 41.8),
    ]

    book_orders = [
        BookOrder(3, 3500, 12, "Большой", 1, "2024-01-06 12:40:21"),
        BookOrder(1, 1400, 4, "Маленький", 2, "2024-01-08 16:12:55"),
        BookOrder(4, 8000, 120, "Большой", 2, "2024-01-09 13:00:43"),
        BookOrder(6, 6700, 18, "Средний", 4, "2024-01-09 13:43:26"),
        BookOrder(5, 5000, 10, "Крупный", 3, "2024-01-12 11:30:59"),
        BookOrder(7, 6000, 8, "Средний", 4, "2024-01-13 12:14:35"),
        BookOrder(2, 1800, 6, "Маленький", 2, "2024-02-14 13:57:29"),
        BookOrder(8, 9000, 20, "Большой", 9, "2024-02-16 11:02:11"),
        BookOrder(4, 7000, 30, "Крупный", 8, "2024-02-17 15:58:04"),
        BookOrder(1, 6000, 12, "Большой", 5, "2024-02-20 17:18:53"),
        BookOrder(9, 12000, 24, "Средний", 2, "2024-03-22 11:43:05"),
        BookOrder(6, 9000, 28, "Маленький", 6, "2024-03-24 15:27:50"),
        BookOrder(10, 15000, 36, "Крупный", 7, "2024-03-27 12:39:48"),
        BookOrder(5, 8000, 20, "Большой", 7, "2024-03-30 14:48:46"),
    ]

    painting_orders = [
        PaintingOrder(13, 1500, 240, 127, "2024-01-09 13:00:43"),
        PaintingOrder(2, 1800, 220, 140, "2024-01-10 13:12:31"),
        PaintingOrder(10, 1000, 160, 100, "2024-01-10 14:40:61"),
        PaintingOrder(9, 600, 100, 50, "2024-02-03 15:17:48"),
        PaintingOrder(11, 1200, 180, 90, "2024-02-06 15:34:52"),
        PaintingOrder(7, 1800, 240, 140, "2024-02-13 13:15:11"),
        PaintingOrder(4, 600, 80, 45, "2024-02-20 16:47:24"),
        PaintingOrder(2, 900, 100, 60, "2024-03-04 14:38:21"),
        PaintingOrder(12, 1500, 240, 165, "2024-03-10 17:09:57"),
        PaintingOrder(6, 1800, 300, 180, "2024-03-18 16:27:02"),
        PaintingOrder(9, 1200, 200, 120, "2024-03-25 12:59:05"),
    ]

    for customer in customers:
        db.add_customer(customer)

    for material in materials:
        db.add_material(material)

    for order in book_orders:
        db.add_book_order(order)

    for order in painting_orders:
        db.add_painting_order(order)


if __name__ == "__main__":
    main()
